# Project Employees

### Loading Data

In [13]:
import pandas as pd

employee_df = pd.read_csv('https://raw.githubusercontent.com/tech-interviews-jigsaw/leet-repo/main/sql/3-joins/employee.csv', index_col = 0)
project_df = pd.read_csv('https://raw.githubusercontent.com/tech-interviews-jigsaw/leet-repo/main/sql/3-joins/project.csv', index_col = 0)

In [14]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgresql://@localhost:5432/sql_interviews')

def insert_data(df, table_name, engine):
    df.to_sql(table_name, engine, if_exists = 'replace', index = False)
    
insert_data(employee_df, 'employee', engine)
insert_data(project_df, 'project', engine)

In [15]:
pd.read_sql('select * from employee limit 2', engine)

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2

In [16]:
pd.read_sql('select * from project limit 2', engine)

   project_id  employee_id
0           1            1
1           1            2

### Problem 1

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

| project_id | average_years |
| ---------- | ------------- |
| 1          | 2             |
| 2          | 2.5           |

```sql 
SELECT p.project_id,
ROUND(AVG(e.experience_years),2) AS average_years
FROM Project p
LEFT JOIN Employee e
ON p.employee_id = e.employee_id
GROUP BY p.project_id;
```

### Problem 2

Write an SQL query that reports all the **projects** that have the most employees.

Return the result table in any order.

| project_id |
| ---------- |
| 1          |

```sql 
SELECT project_id
FROM project
GROUP BY project_id
HAVING COUNT(employee_id) =
(
    SELECT count(employee_id)
    FROM project
    GROUP BY project_id
    ORDER BY count(employee_id) desc
    LIMIT 1
)
```